app/controllers/api/products_controller.rb

  def index
    @products = Product.includes(:comments).all
---
SELECT "products".* FROM "products"